backend: tensorflow
class_name: Model
config:
  input_layers:
  - - conv1d_1_input
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: &id001 !!python/tuple
      - null
      - 187
      - 1
      dtype: float32
      name: conv1d_1_input
      sparse: false
    inbound_nodes: []
    name: conv1d_1_input
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      batch_input_shape: *id001
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      name: conv1d_1
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv1d_1_input
        - 0
        - 0
        - {}
    name: conv1d_1
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      name: conv1d_2
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv1d_1
        - 0
        - 0
        - {}
    name: conv1d_2
  - class_name: MaxPooling1D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling1d_1
      padding: valid
      pool_size: !!python/tuple
      - 5
      strides: !!python/tuple
      - 2
      trainable: true
    inbound_nodes:
    - - - conv1d_2
        - 0
        - 0
        - {}
    name: max_pooling1d_1
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      name: conv1d_3
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling1d_1
        - 0
        - 0
        - {}
    name: conv1d_3
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple
      - 1
      dtype: float32
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      kernel_size: !!python/tuple
      - 5
      name: conv1d_4
      padding: same
      strides: !!python/tuple
      - 1
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv1d_3
        - 0
        - 0
        - {}
    name: conv1d_4
  - class_name: MaxPooling1D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling1d_2
      padding: valid
      pool_size: !!python/tuple
      - 5
      strides: !!python/tuple
      - 2
      trainable: true
    inbound_nodes:
    - - - conv1d_4
        - 0
        - 0
        - {}
    name: max_pooling1d_2
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      dtype: float32
      go_backwards: false
      implementation: 2
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: lstm_1
      recurrent_activation: sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config:
          gain: 1.0
          seed: null
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 128
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - max_pooling1d_2
        - 0
        - 0
        - {}
    name: lstm_1
  - class_name: Flatten
    config:
      data_format: channels_last
      dtype: float32
      name: flatten_1
      trainable: true
    inbound_nodes:
    - - - lstm_1
        - 0
        - 0
        - {}
    name: flatten_1
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - flatten_1
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 2
      use_bias: true
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: dense_2
  name: model_1
  output_layers:
  - - dense_2
    - 0
    - 0
keras_version: 2.3.1
